<a href="https://colab.research.google.com/github/YashasaveeKesarwani99/Machine-Learning-Algo/blob/main/decision-tree-classifier.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Using Decision Trees to predict survival in Titanic dataset**

In [1]:
import seaborn as sns
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

from google.colab import files

uploaded = files.upload()

Saving tested.csv to tested.csv

In [3]:
import io

data = pd.read_csv(io.BytesIO(uploaded['tested.csv']))
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0          892         0       3  ...   7.8292   NaN         Q
1          893         1       3  ...   7.0000   NaN         S
2          894         0       2  ...   9.6875   NaN         Q
3          895         0       3  ...   8.6625   NaN         S
4          896         1       3  ...  12.2875   NaN         S

[5 rows x 12 columns]

In [4]:
data.drop(['PassengerId','Name','Age','SibSp','Ticket','Fare','Cabin'], axis='columns', inplace=True)
data.head()

   Survived  Pclass     Sex  Parch Embarked
0         0       3    male      0        Q
1         1       3  female      0        S
2         0       2    male      0        Q
3         0       3    male      0        S
4         1       3  female      1        S

In [8]:
Sex = pd.get_dummies(data["Sex"] , drop_first=True)
Embarked = pd.get_dummies(data["Embarked"] , drop_first=True)
data.head()

   Survived  Pclass     Sex  Parch Embarked
0         0       3    male      0        Q
1         1       3  female      0        S
2         0       2    male      0        Q
3         0       3    male      0        S
4         1       3  female      1        S

In [9]:
data = pd.concat([data, Sex, Embarked], axis=1)
data.head()

   Survived  Pclass     Sex  Parch Embarked  male  Q  S
0         0       3    male      0        Q     1  1  0
1         1       3  female      0        S     0  0  1
2         0       2    male      0        Q     1  1  0
3         0       3    male      0        S     1  0  1
4         1       3  female      1        S     0  0  1

In [10]:
data.drop(['Sex','Embarked'],axis='columns',inplace=True)
data.head()

   Survived  Pclass  Parch  male  Q  S
0         0       3      0     1  1  0
1         1       3      0     0  0  1
2         0       2      0     1  1  0
3         0       3      0     1  0  1
4         1       3      1     0  0  1

In [15]:
Y = data.iloc[:,0]
X = data.iloc[:,1:6]


from sklearn.model_selection import train_test_split
train_x, test_x, train_y, test_y = train_test_split(X,Y,test_size = 0.3, random_state = 2)

In [21]:
# params for hyperparameter tuning

param_dt = {
    "criterion":["gini","entropy"]
}

In [18]:
# applying decision tree algorithm

from sklearn.tree import DecisionTreeClassifier
dtc = DecisionTreeClassifier()

In [19]:
dtc.fit(train_x,train_y)
dtc.score(test_x,test_y)

1.0

In [22]:
# parameter tuning

from sklearn.model_selection import GridSearchCV
grid = GridSearchCV(dtc,param_grid=param_dt,cv=10)

grid.fit(train_x,train_y)
grid.score(test_x,test_y)

1.0